<?php
namespace app\index\service;
class Stars{
    /**贵人的序号及名字
     * @var $start_name array
     */
    public $start_name = [
        //为方便对照,把序号也写出来
        1=>'天医',
        2=>'天德',
        3=>'月德',
        4=>'禄神',
        5=>'羊刃',
        6=>'孤鸾',
        7=>'空亡',
        8=>'三奇',
        9=>'天赦',
        10=>'德秀',
        11=>'魁罡',
        12=>'金神',
        13=>'天罗',
        14=>'地网',
        15=>'天乙',
        16=>'太极',
        17=>'文昌',
        18=>'金舆',
        19=>'福星',
        20=>'国印',
        21=>'天厨',
        22=>'学堂',
        23=>'红艳',
        24=>'流霞',
        25=>'将星',
        26=>'华盖',
        27=>'驿马',
        28=>'劫煞',
        29=>'亡神',
        30=>'桃花',
        31=>'元辰',
        32=>'孤辰',
        33=>'寡宿',
        34=>'的煞',
        35=>'灾煞',
        36=>'六厄'
    ];

}
